In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {'AAA': [4, 5, 6, 7],
     'BBB':[10, 20, 30, 40],
     'CCC':[100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

### df.loc
- df.loc[로우 인덱스, 컬럼 인덱스]

In [3]:
df.loc[df.AAA >= 5, 'BBB'] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [4]:
df.loc[df.AAA >= 5, ['BBB', 'CCC']] = 2000
df

   AAA   BBB   CCC
0    4    10   100
1    5  2000  2000
2    6  2000  2000
3    7  2000  2000

### df.where
- 대상_DataFrame.where(조건_DataFrame,<br>
 조건_DataFrame에서 값이 False인 경우 넣을 값)

In [5]:
df_mask = pd.DataFrame(
    {'AAA' : [True] * 4,
     'BBB' : [False] * 4,
     'CCC' : [True,False] * 2}
)
df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [6]:
df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000   100
1    5 -1000 -1000
2    6 -1000  2000
3    7 -1000 -1000

In [7]:
df = pd.DataFrame(
    {'AAA': [4, 5, 6, 7],
     'BBB':[10, 20, 30, 40],
     'CCC':[100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [8]:
df['logic'] = np.where(df['AAA'] > 5, 'high', 'low')
df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

In [9]:
dflow = df[df.AAA <= 5]
dflow

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low

In [10]:
dfhigh = df[df.AAA > 5]
dfhigh

   AAA  BBB  CCC logic
2    6   30  -30  high
3    7   40  -50  high

In [11]:
newseries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40), 'AAA']
newseries

0    4
1    5
Name: AAA, dtype: int64

In [12]:
aValue = 43.0
df.loc[(df.CCC-aValue).abs().argsort()]

   AAA  BBB  CCC logic
1    5   20   50   low
0    4   10  100   low
2    6   30  -30  high
3    7   40  -50  high

In [13]:
df.loc[(df.CCC-aValue).abs().argsort()]

   AAA  BBB  CCC logic
1    5   20   50   low
0    4   10  100   low
2    6   30  -30  high
3    7   40  -50  high

In [14]:
df[(df.AAA <= 6) & (df.index.isin([0,2,4]))]

   AAA  BBB  CCC logic
0    4   10  100   low
2    6   30  -30  high

In [15]:
data = {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}

df = pd.DataFrame(data=data,index=['foo','bar','boo','kar'])
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [16]:
df.loc['bar':'kar'] #Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [17]:
df.iloc[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [18]:
df.loc['bar':'kar']

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [19]:
df2 = pd.DataFrame(data=data,index=[1,2,3,4]); #Note index starts at 1.
df2.iloc[1:3] #Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [20]:
df = pd.DataFrame(
    {'AAA' : [4,5,6,7],
     'BBB' : [10,20,30,40],
     'CCC' : [100,50,-30,-50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [21]:
df[~((df.AAA <= 6) & (df.index.isin([0,2,4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

### pd.Panel({})
* 3-D container
* eg. CNN 모델에서 이미지

In [39]:
rng = pd.date_range('1/1/2013', periods=100, freq='D')
data = np.random.randn(100, 4)
cols = ['A', 'B', 'C', 'D']
df1, df2, df3 = pd.DataFrame(data, rng, cols), pd.DataFrame(data, rng, cols), pd.DataFrame(data, rng, cols)
pf = pd.Panel({'df1':df1, 'df2':df2, 'df3':df3})
pf

C:\Users\renz\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 4 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to D

### NEW Colums
* creating new colums using applymap

In [43]:
df = pd.DataFrame({
    'AAA': [1, 2, 1, 3],
    'BBB': [1, 1, 2, 2],
    'CCC': [2, 1, 3, 1]
})

In [46]:
source_cols = df.columns
new_cols = [str(x) + "_cat" for x in source_cols]
categories = {1:'Alpah', 2:'Beta', 3:'Charlie'}
df[new_cols] = df[source_cols].applymap(categories.get)
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpah   Alpah     Beta
1    2    1    1     Beta   Alpah    Alpah
2    1    2    3    Alpah    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpah

In [48]:
df = pd.DataFrame(
    {'AAA' : [1,1,1,2,2,2,3,3], 'BBB' : [2,1,3,4,5,1,2,3]})
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [49]:
df.loc[df.groupby('AAA')['BBB'].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [52]:
sort_df = df.sort_values(by='BBB')
sort_df

   AAA  BBB
1    1    1
5    2    1
0    1    2
6    3    2
2    1    3
7    3    3
3    2    4
4    2    5

In [54]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2